{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input1"}, "name": "input1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "encoder_right_layer1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "encoder_right_layer1", "inbound_nodes": [[["input1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "encoder_right_layer2", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "encoder_right_layer2", "inbound_nodes": [[["encoder_right_layer1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input2"}, "name": "input2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input3"}, "name": "input3", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "encoder_right_layer3", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "encoder_right_layer3", "inbound_nodes": [[["encoder_right_layer2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["input2", 0, 0, {}], ["input3", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "encoder_right_layer4", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 13}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 14}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 15}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "encoder_right_layer4", "inbound_nodes": [[["encoder_right_layer3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "encoder_left_layer1", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_left_layer1", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "encoder_right_layer5", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "encoder_right_layer5", "inbound_nodes": [[["encoder_right_layer4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "Combined_layer1", "trainable": true, "dtype": "float32"}, "name": "Combined_layer1", "inbound_nodes": [[["encoder_left_layer1", 0, 0, {}], ["encoder_right_layer5", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "Combined_layer2", "trainable": true, "dtype": "float32", "n": 29}, "name": "Combined_layer2", "inbound_nodes": [[["Combined_layer1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "Decoder_layer1", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 25}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 26}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 27}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "Decoder_layer1", "inbound_nodes": [[["Combined_layer2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Decoder_layer2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Decoder_layer2", "inbound_nodes": [[["Decoder_layer1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "Decoder_layer3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "Decoder_layer3", "inbound_nodes": [[["Decoder_layer2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Decoder_layer4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "Decoder_layer4", "inbound_nodes": [[["Decoder_layer3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Decoder_layer5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Decoder_layer5", "inbound_nodes": [[["Decoder_layer4", 0, 0, {}]]]}], "input_layers": [["input1", 0, 0], ["input2", 0, 0], ["input3", 0, 0]], "output_layers": [["Decoder_layer5", 0, 0]]}, "keras_version": "2.5.0", "backend": "tensorflow"}